print("逻辑运算")
'''
逻辑运算符：not -- 非（将bool结果取反）   and -- 与（两个表达式，任意一边为假即为假）    or -- 或（两个表达式，只要一个为真即为真）
'''
print(not True)
print(True and True)
print(True or False)

'''
位运算。---位运算都要把数据转换成二进制，再进行计算--只有0 1
如：10&5（1&1==1，1&0==0）
10  ---二进制---  00001010
5   ---二进制---  00000101
----------------------------
                  0000000
'''
print(bin(int(10)))#2进制转换
print(bin(int(5)))
print('10&5的结果：',10&5)

'''
10 | 5(有1参与或，那么结果为1)
10  ---二进制---  00001010
5   ---二进制---  00000101
---------------------------
                  00001111
'''
print(int('00001111',2))#2进制转10进制
print('10|5的结果',10|5)

'''
10 ^ 7(按位异或，相异为1，相同为0)
10  ---二进制---  00001010
7   ---二进制---  00000111
---------------------------
                  00001101
'''
print(bin(int(7)))
print(int('00001101',2))#2进制转10进制
print('10^7的结果',10^7)

'''
~ :翻转，公式：~x --->  -(x)-1
'''
print('~10的结果：',~10)
'''
>>:右位移，例：5>>3.右移表示，x整除2的n次方  5>>3 == 5//2^3 = 5//8 = 0 
5   ---二进制---  00000101
---------------------------
      右位移      00000000
<<:左位移:例：10<<2.左移表示，x乘以2的n次方，10<<2 == 10*2^2 =10*4 = 40
10  ---二进制---  00001010
----------------------------
    左移两位      00101000
'''
print(int('00101000',2))#2进制转10进制
print('10<<2的结果：',10<<2)
print('5>>3的结果：',5>>3)

'''
三元运算符：三个表达式参与运算
...if 表达式 else ...
'''
print('三元运算符', 5 if 10>5 else 10)#如果if后表达式为真，则取if前面的值作为结果，如果if后表达式为假，则取else后的数作为结果

print(
'''
python运算符优先级（从上往下优先级从高到底）
** 指数（优先级最高）
~  换位反转
* / % // 乘 除 取模 整除
+ - 加法 减法
>> << 右移 左移
& 位‘AND’
^ | 位运算符
<= < > >= 比较运算符
<> == != 等于运算符
= %= /= //= -= += *= **= 赋值运算符
is is not 身份运算符
in not in 成员运算符
not or and 逻辑运算符
''')

'''

'''